app/controllers/jmeter_runs_controller.rb

SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`project_id` = 1 ORDER BY updated_at
---
  def index
    @project ||= Project.find_by_param(params[:project_id])
    @jmeter_runs ||= JmeterRun.find_all_by_project_id(params[:project_id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 28 LIMIT 1
---
  def show
    @project ||= Project.find_by_id(params[:project_id])