app/controllers/jmeter_runs_controller.rb

  def index
    if params[:project_id].match(/^[\d]+(\.[\d]+){0,1}$/)
      @project = Project.find(params[:project_id])
    else
      @project = Project.find_by_name(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`name` = 'testproject01' LIMIT 1

  def show
    if params[:id].match(/^[\d]+(\.[\d]+){0,1}$/)
      @jmeter_run = JmeterRun.find(params[:id])
    else
      @jmeter_run = Project.find_by_name(params[:name]).jmeter_runs
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`name` = 'status' LIMIT 1

  def edit
    @jmeter_run = JmeterRun.find(params[:id])
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 17 LIMIT 1

  def create
    @jmeter_run = JmeterRun.new(params[:jmeter_run])

    respond_to do |format|
      if @jmeter_run.save
---
INSERT INTO `jmeter_runs` (`created_at`, `description`, `jmeter_pid`, `jmx_source`, `locked`, `project_id`, `state`, `stderror`, `stdout`, `updated_at`) VALUES ('2012-08-06 15:00:40', NULL, 0, NULL, 0, NULL, 'idle', '0', '0', '2012-08-06 15:00:40')

  def destroy
    @jmeter_run = JmeterRun.find(params[:id])
    @jmeter_run.destroy
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 12 LIMIT 1
DELETE FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 12

  def status
    @jmeter_run_state = JmeterRun.find(params[:id]).state
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 28 LIMIT 1

    def start
    @jmeter_run_start = JmeterRun.find(params[:id]).start
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`id` = 1 LIMIT 1