app/controllers/projects_controller.rb

  def show
    @project ||= Project.find_by_param(params[:id])
    @jmeter_runs ||= JmeterRun.find_all_by_project_id(params[:id])
---
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`project_id` = 1 ORDER BY updated_at