app/controllers/projects_controller.rb

  def show
    if params[:id].match(/^[\d]+(\.[\d]+){0,1}$/)
      Rails.logger.warn 'find a number'
      @project = Project.find_by_id(params[:id])
    else
      Rails.logger.warn 'find an string'
      @project = Project.find_by_name(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`name` = 'testproject01' LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`created_at`, `environment`, `name`, `updated_at`) VALUES ('2012-08-06 12:12:47', 'stage', 'gala.de', '2012-08-06 12:12:47')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 8 LIMIT 1
UPDATE `projects` SET `updated_at` = '2012-08-08 12:08:44', `environment` = 'live' WHERE `projects`.`id` = 8

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 7 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 7

  def addrun
    @jmeter_run = JmeterRun
    @project = Project.find_by_name(params[:id])
    @project.jmeter_runs.create(:description => "created at #{Time.now} ", :jmx_source => @project.setting.jmx_file)

    if @project.save
      respond_to do |format|
        format.json { render :json => @project.jmeter_runs.last.id}
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`name` = 'imageGalaDe' LIMIT 1
INSERT INTO `jmeter_runs` (`created_at`, `description`, `jmeter_pid`, `jmx_source`, `locked`, `project_id`, `state`, `stderror`, `stdout`, `updated_at`) VALUES ('2012-08-07 07:52:09', NULL, 0, NULL, 0, 6, 'idle', '0', '0', '2012-08-07 07:52:09')
UPDATE `projects` SET `updated_at` = '2012-08-07 07:52:09' WHERE `projects`.`id` = 6
SELECT `jmeter_runs`.* FROM `jmeter_runs` WHERE `jmeter_runs`.`project_id` = 6 ORDER BY updated_at DESC LIMIT 1