app/controllers/settings_controller.rb

SELECT `settings`.* FROM `settings` WHERE `settings`.`project_id` = 1 LIMIT 1
---
  def index
    @settings ||= Setting.find_by_project_id(params[:project_id])

SELECT `settings`.* FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
---
  def show
    @setting = Setting.find(params[:id])